In [14]:
import psycopg2
import pandas as pd

In [7]:
def connection(user, pwd, db, host = "localhost"):
    
    host = host
    database = db
    user = user
    password = pwd
    
    conn = psycopg2.connect(host = host, database = db, user = user, password = password)
    return conn

In [59]:
def get_data_as_df(table, conn):
    
    data = pd.read_sql(f"SELECT * FROM {table}", conn)
    
    return data

In [60]:
conn = connection("andreas", "Phantomias3782", "StreamingService")

In [61]:
curr = conn.cursor()

In [62]:
user = get_data_as_df('user_table', conn)

In [71]:
# update value in db
user.loc[user["f_name"] == "Marie", "city"] = "Las Vegas"

In [72]:
user

,f_name,l_name,userid,zip_code,city,home_state,country,email,birthdate,abotype,bankaccount
0,Marie,Sanders,1,1234,Las Vegas,Texas,U.S.A.,marie@sanders.com,1971-03-09,Test,5505 8765 9863
1,Jack,Rhino,2,5643,Huston,Nevada,U.S.A.,jack@rhino.net,1971-08-19,Normal,5505 0076 1233
2,Tony,Stark,3,7753,Paris,Ile de Paris,France,tony.stark@avengers.com,1991-11-22,Premium,1123 0854 6466

In [90]:
updated_city = 'Wymonig'

In [ ]:
set_city =

In [93]:
sql = f'''
    UPDATE users
    SET city = {updated_city}
    WHERE userid = 1
'''

In [94]:
curr.execute(sql, ('city', 'userid'))

InFailedSqlTransaction: current transaction is aborted, commands ignored until end of transaction block